{
    "count": 10,
    "news": [
        {
            "title": "Luigi Mangione pleads not guilty at arraignment on state murder charges",
            "top_image": "https://i.abcnewsfe.com/a/3e7abd70-c755-4042-b1c6-2b9e82b9baa6/luigi-mangione-16-gty-gmh-241223_1734966724244_hpMain_16x9.jpg?w=1600",
            "images": [
                "https://s.abcnews.com/assets/dtci/images/hulu.svg",
                "https://i.abcnewsfe.com/a/3e7abd70-c755-4042-b1c6-2b9e82b9baa6/luigi-mangione-16-gty-gmh-241223_1734966724244_hpMain_16x9.jpg?w=992",
                "https://i.abcnewsfe.com/a/3e7abd70-c755-4042-b1c6-2b9e82b9baa6/luigi-mangione-16-gty-gmh-241223_1734966724244_hpMain.jpg",
                "https://i.abcnewsfe.com/a/eb02c87a-60fc-474b-af87-49d2c8a3f7f9/luigi-mangione-19-gty-gmh-241223_1734967285312_hpMain.jpg",
                "https://i.abcnewsfe.com/a/1d0b8949-f49f-4814-9abe-8fef287ded5b/luigi-mangione-3-rt-gmh-241223_1734964265432_hpMain.jpg",
                "https://i.abcnewsfe.com/a/cd67e431-4619-4d40-b518-5e850785459b/luigi-mangione-4-rt-gmh-241223_1734964534111_hpMain.jpg",
                "https://i.abcnewsfe.com/a/dd4c9155-39ab-4dde-b487-d025050fbdd8/luigi-mangione-22-rt-gmh-241219_1734644415477_hpMain_4x3.jpg",
                "https://i.abcnewsfe.com/a/59e66f97-a819-4553-bc7f-c9c4471a5ce3/starbucks_1734663348783_hpMain_2_1x1.jpg?w=208",
                "https://i.abcnewsfe.com/a/172adfb7-ca7e-4fa5-a65a-68be45439f0f/suspect-homicide-subway-nyc-ht-lv-241222-4_1734904958276_hpMain_1x1.jpg?w=208",
                "https://i.abcnewsfe.com/a/93010ec5-8b0d-47fc-959b-5879d074e5ad/ga-file-ap-ml-241218_1734527639405_hpMain_1x1.jpg?w=208",
                "https://i.abcnewsfe.com/a/dae5ea1a-61eb-43f3-90f1-95947c8d251a/houston-police-department-gty-lv-241222_1734884560792_hpMain_1x1.jpg?w=208"
            ],
            "videos": [],
            "url": "https://abcnews.go.com/US/ceo-killing-suspect-mangione-manhattan-court-arraignment-state/story?id=117041573",
            "date": "Mon, 23 Dec 2024 15:11:15 GMT",
            "short_description": "CEO killing suspect Luigi Mangione pleads not guilty in Manhattan court to state murder charges  ABC NewsLuigi Mangione Pleads Not Guilty to N.Y. Charges in UnitedHealthcare CEO Killing  The New York TimesWatch: Moment Luigi Mangione pleads not guilty to murder and terror charges  Sky NewsSuspect Luigi Mangione pleads not guilty to state murder and terror charges in CEO killing  WPVI-TVLuigi Mangione Pleads Not Guilty to New York Murder Charges, Lawyer Concerned He Can't Get Fair Trial  PEOPLE",
            "text": "Luigi Mangione on Monday pleaded not guilty to state murder and terror charges in the fatal shooting of UnitedHealthcare CEO Brian Thompson as his attorney protested his treatment, saying in court that her client is being used as \"political fodder\" by police and the mayor of New York City.\n\nThe 26-year-old Mangione entered the Manhattan courtroom in shackles and under heavy guard. He was dressed in civilian clothes, wearing a maroon sweater over a light-colored shirt, and a pair of chinos.\n\nMangione spoke into a microphone, saying \"Not guilty\" to the 11 charges in the indictment, including first-degree murder in furtherance of terrorism. Judge Gregory Carro presided over the arraignment.\n\nThe high-profile defendant appeared to not have family in the courtroom.",
            "publisher": {
                "href": "https://abcnews.go.com",
                "title": "ABC News"
            }
        },
      
        {
            "title": "FACT SHEET: President Biden Commutes the Sentences of 37 Individuals on Death Row",
            "top_image": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png",
            "images": [
                "https://www.whitehouse.gov/wp-content/themes/whitehouse/assets/img/wh-outline.svg",
                "https://www.whitehouse.gov/wp-content/themes/whitehouse/assets/img/bottomcta-logo.svg",
                "https://www.whitehouse.gov/wp-content/themes/whitehouse/assets/img/footer-seal.svg"
            ],
            "videos": [],
            "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/fact-sheet-president-biden-commutes-the-sentences-of-37-individuals-on-death-row/",
            "date": "Mon, 23 Dec 2024 10:01:00 GMT",
            "short_description": "FACT SHEET: President Biden Commutes the Sentences of 37 Individuals on Death Row  The White HouseBiden Commutes 37 Death Sentences Ahead of Trump’s Plan to Resume Federal Executions  The New York TimesBiden commutes sentences of nearly all federal death row inmates | See who is not on the list  WPVI-TVPresident Biden commutes death sentence of notorious drug kingpin Kaboni Savage  The Philadelphia InquirerOne of the killers Biden commuted from death row has a York connection  York Daily Record",
            "text": "Today, President Biden announced that he is commuting the sentences of 37 individuals on federal death row. Those individuals will have their sentences reclassified from execution to life without the possibility of parole.\n\nPresident Biden has dedicated his career to reducing violent crime and ensuring a fair and effective justice system. He believes that America must stop the use of the death penalty at the federal level, except in cases of terrorism and hate-motivated mass murder – which is why today’s actions apply to all but those cases. When President Biden came into office, his Administration imposed a moratorium on federal executions, and his actions today will prevent the next Administration from carrying out the execution sentences that would not be handed down under current policy and practice.\n\nThis historic clemency action builds on the President’s record of criminal justice reform. The President has issued more commutations at this point in his presidency than any of his recent predecessors at the same point in their first terms. Earlier this month, the President announced clemency for approximately 1,500 Americans – the most ever in a single day – who have shown successful rehabilitation and a commitment to making communities safer. This included sentence commutations for nearly 1,500 individuals who were placed on home confinement during the COVID-19 pandemic and who have successfully reintegrated into their families and communities, as well as 39 pardons for individuals who were convicted of non-violent crimes. President Biden is also the first President ever to issue categorical pardons to individuals convicted of simple use and possession of marijuana, and to former LGBTQI+ service members convicted of private conduct because of their sexual orientation.\n\nThe President’s criminal justice record has transformed individual lives and positively impacted communities, especially historically marginalized communities. In the coming weeks, the President will take additional steps to provide meaningful second chances and continue to review additional pardons and commutations.\n\n###\n\nToday, President Joseph R. Biden, Jr. is commuting the sentences of the following 37 individuals to life imprisonment without the possibility of parole:",
            "publisher": {
                "href": "https://www.whitehouse.gov",
                "title": "The White House"
            }
        },
        {
            "title": "Donald Trump and Panama trade blows over control of canal",
            "top_image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F19b29601-0f62-4658-961b-8826df388068.jpg?source=next-barrier-page",
            "images": [
                "https://www.ft.com/__origami/service/image/v2/images/raw/https://barrier-page-components.s3.eu-west-1.amazonaws.com/assets/images/us_election_2024/hero_banner_us_election_white_house_watch.png?source=next-barrier-page",
                "https://www.ft.com/__origami/service/image/v2/images/raw/https://barrier-page-components.s3.eu-west-1.amazonaws.com/assets/icons/primary_product_icon_digital_edition.svg?source=next-barrier-page&format=svg",
                "https://www.ft.com/__origami/service/image/v2/images/raw/https://barrier-page-components.s3.eu-west-1.amazonaws.com/assets/icons/primary_product_icon_standard.svg?source=next-barrier-page&format=svg",
                "https://www.ft.com/__origami/service/image/v2/images/raw/https://barrier-page-components.s3.eu-west-1.amazonaws.com/assets/icons/primary_product_icon_premium.svg?source=next-barrier-page&format=svg",
                "https://spoor-api.ft.com/px.gif?data=%7B%22category%22%3A%22page%22%2C%22action%22%3A%22view%22%2C%22system%22%3A%7B%22source%22%3A%22non-ctm%22%7D%2C%22context%22%3A%7B%22name%22%3A%22barrier-page%22%2C%22product%22%3A%22next%22%2C%22data%22%3A%7B%22source%22%3A%22%5BSOURCE%5D%22%7D%7D%7D"
            ],
            "videos": [],
            "url": "https://www.ft.com/content/51a368ef-00d9-44f5-a2f7-2508a68e5ce2",
            "date": "Mon, 23 Dec 2024 01:09:14 GMT",
            "short_description": "Donald Trump and Panama trade blows over control of canal  Financial TimesPanama's president hits back at Trump idea to reclaim key canal  Fox NewsWho owns the Panama Canal and what does Trump want with it?  The GuardianPresident of Panama fires back at Trump: Canal ‘belongs to Panama’  Yahoo! Voices",
            "text": "The new FT Digital Edition: today’s FT, cover to cover on any device. This subscription does not include access to ft.com or the FT App.\n\nEssential digital access to quality FT journalism on any device. Pay a year upfront and save 20%.",
            "publisher": {
                "href": "https://www.ft.com",
                "title": "Financial Times"
            }
        },
        {
            "title": "Suspect arrested after woman fatally set on fire on New York subway",
            "top_image": "https://www.aljazeera.com/wp-content/uploads/2024/12/2024-12-22T222040Z_125708076_RC2DUBAFSBAW_RTRMADP_3_NEW-YORK-CRIME-SUBWAY-1734941669.jpg?resize=1920%2C1270",
            "images": [
                "https://www.aljazeera.com/wp-content/uploads/2024/12/2024-12-22T222040Z_125708076_RC2DUBAFSBAW_RTRMADP_3_NEW-YORK-CRIME-SUBWAY-1734941669.jpg?resize=770%2C513&quality=80",
                "https://www.aljazeera.com/static/media/aj-footer-logo.bac952ad.svg"
            ],
            "videos": [],
            "url": "https://www.aljazeera.com/news/2024/12/23/suspect-arrested-after-woman-fatally-set-on-fire-on-new-york-subway",
            "date": "Mon, 23 Dec 2024 11:05:59 GMT",
            "short_description": "Suspect arrested after woman fatally set on fire on New York subway  Al Jazeera EnglishTrump border czar blasts NY governor for touting subway safety hours after horrific murder: 'Shame on you'  Fox NewsMan arrested after woman killed in Brooklyn F train fire, police say  GothamistSuspect arrested in the killing of a woman who was set on fire on a NYC subway car  CNNExclusive | Fiend accused of burning woman to death on NYC subway is illegal migrant from Guatemala who sneaked into US after he was deported  New York Post ",
            "text": "Police in New York City have arrested a man they suspect set a woman on fire while she appeared to be asleep on the subway train, killing her.\n\nThe woman, who has not been identified, sat motionlessly on board a stationary F train at the Coney Island-Stillwell Avenue subway station in Brooklyn at about 7:30am (12:30 GMT) when an unknown man calmly approached her and used a lighter to set her clothes on fire, the New York Police Department said.\n\nTransit police apprehended the suspect after receiving a report from three high school students who had recognised the man. They had seen images of the suspect taken from surveillance and police body cam video and widely distributed by police.\n\nThe man got off the car as police officers on patrol in the station rushed to the blaze.\n\n“New Yorkers came through again,” said New York Police Commissioner Jessica Tisch, who described the case as “one of the most depraved crimes one person could possibly commit against another human being”.\n\nThe officers used fire extinguishers to put out the fire and the woman was pronounced dead at the scene by emergency responders, police said.\n\nPolice said they were still investigating the victim’s identity and the reason for the attack. They added there was no interaction before the attack and they did not believe the two people knew each other.\n\nCellphone video published on social media by a horrified onlooker also showed a man sitting on a bench on the platform a few steps away from the burning woman, dressed in a grey hoodie that resembles that worn by the suspect arrested later on Sunday.\n\nAsked whether the man watching from the bench was the attacker, police said that responding officers had no reason to think he was a suspect when they rushed to the woman’s aid.\n\nAbout four million trips are taken each weekday on the city’s subway, where violent crime is relatively rare. As of November, there had been nine homicides reported on the subway in 2024, compared to five in the same period in 2023, according to police data.\n\nEarlier this month, a jury acquitted Daniel Penny of criminally negligent homicide in the death of Jordan Neely, a homeless former Michael Jackson impersonator, on the city’s subway.\n\nNeely had been shouting angrily at passengers on a subway train when Penny grabbed him from behind and restrained him in a chokehold for several minutes.",
            "publisher": {
                "href": "https://www.aljazeera.com",
                "title": "Al Jazeera English"
            }
        
        }
    ]
}